#Найти траекторию полета кометы, залетевшей в Солнечную систему, у которой на расстоянии 
# от Солнца 100 астрономических единиц (1 а.е. = 1,50.1011 м – расстояние от Земли до Солнца) 
# скорость v=10 км/с и направленапод углом  = 30о к оси «комета-Солнце». Является ли эта 
# траектория замкнутой? Если да, то сколько длится для нее период полета?

#В условиях задачи варианта 2 подобрать то значение угла , при котором траектория 
# из незамкнутойпревращается в замкнутую (скорость v фиксирована).